app/controllers/beverages_controller.rb

SELECT * FROM "beverages"
---
  def index
    @beverages = Beverage.all

INSERT INTO "beverages" ("beverage_type_id", "name", "created_at", "carbonated", "updated_at", "description") VALUES(NULL, 'New drink', '2009-09-19 15:25:31', NULL, '2009-09-19 15:25:31', 'Tasty')
---
  def create
    @beverage = Beverage.create! params[:beverage]  # { :name => 'Whatever' }

UPDATE "beverages" SET "updated_at" = '2009-09-19 15:20:37', "name" = 'Strawberry Lemonade' WHERE "id" = 977661844
---
  def update
    current_beverage.update_attributes params[:beverage]

DELETE FROM "beverages" WHERE ("id" IN ('977661844'))
---
  def destroy
    Beverage.delete(params[:id])